Revit 2026 API

# ItemFactoryBaseNewReferencePlane2 Method

---

Creates a new instance of ReferencePlane.

**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ReferencePlane NewReferencePlane2(
	XYZ bubbleEnd,
	XYZ freeEnd,
	XYZ thirdPnt,
	View pView
)
```
```vb
Public Function NewReferencePlane2 (
	bubbleEnd As XYZ,
	freeEnd As XYZ,
	thirdPnt As XYZ,
	pView As View
) As ReferencePlane
```
```cpp
public:
ReferencePlane^ NewReferencePlane2(
	XYZ^ bubbleEnd,
	XYZ^ freeEnd,
	XYZ^ thirdPnt,
	View^ pView
)
```
```fsharp
member NewReferencePlane2 :
        bubbleEnd : XYZ *
        freeEnd : XYZ *
        thirdPnt : XYZ *
        pView : View -> ReferencePlane
```

#### Parameters

bubbleEnd XYZ
     The bubble end applied to reference plane.
freeEnd XYZ
     The free end applied to reference plane.
thirdPnt XYZ
     A third point needed to define the reference plane.
pView View
     The specific view apply to the Reference plane.

#### Return Value

ReferencePlane The newly created reference plane.

The specific view is applied to the Reference plane only for certain view types: LegendDraftingViewDrawingSheet

#### Reference

ItemFactoryBase Class

Autodesk.Revit.Creation Namespace